In [2]:
# your code here
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
import pymysql

# Mandatory Challenge
## Context
You work in the data analysis team of a very important company. On Monday, the company shares some good news with you: you just got hired by a major retail company! So, let's get prepared for a huge amount of work!

Then you get to work with your team and define the following tasks to perform:   
1. You need to start your analysis using data from the past.  
2. You need to define a process that takes your daily data as an input and integrates it.  

You are in charge of the second part, so you are provided with a sample file that you will have to read daily. To complete you task, you need the following aggregates:
* One aggregate per store that adds up the rest of the values.
* One aggregate per item that adds up the rest of the values.

You can import the dataset `retail_sales` from Ironhack's database. 

## Your task
Therefore, your process will consist of the following steps:
1. Read the sample file that a daily process will save in your folder. 
2. Clean up the data.
3. Create the aggregates.
4. Write three tables in your local database: 
    - A table for the cleaned data.
    - A table for the aggregate per store.
    - A table for the aggregate per item.

## Instructions
* Read the csv you can find in Ironhack's database.
* Clean the data and create the aggregates as you consider.
* Create the tables in your local database.
* Populate them with your process.

In [3]:
driver  = 'mysql+pymysql:'
user    = 'root'
password= 'Tarradellas90'
ip      = ':3306'
database= 'retail_sales'

connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
conn = create_engine(connection_string)
print(connection_string)
print(conn)

mysql+pymysql://root:Tarradellas90@:3306/retail_sales
Engine(mysql+pymysql://root:***@:3306/retail_sales)

In [4]:
#df = pd.read_sql('SELECT * FROM authors', engine)
df_raw_sales = pd.read_sql('SELECT * FROM raw_sales', conn)
df_raw_sales

C:\Users\Migue Granica\AppData\Local\Programs\Python\Python38-32\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xE1ndar ...' for column 'VARIABLE_VALUE' at row 485")
  result = self._query(query)

           date  shop_id  item_id  item_price  item_cnt_day
0    2015-01-04       29     1469      1199.0           1.0
1    2015-01-04       28    21364       479.0           1.0
2    2015-01-04       28    21365       999.0           2.0
3    2015-01-04       28    22104       249.0           2.0
4    2015-01-04       28    22091       179.0           1.0
...         ...      ...      ...         ...           ...
4540 2015-01-04       15     4240      1299.0           1.0
4541 2015-01-04       14    21922        99.0           1.0
4542 2015-01-04       15     1969      3999.0           1.0
4543 2015-01-04       14    22091       179.0           1.0
4544 2015-01-04       15     1007      1199.0           1.0

[4545 rows x 5 columns]

In [5]:
df_raw_sales.describe()

           shop_id       item_id    item_price  item_cnt_day
count  4545.000000   4545.000000   4545.000000   4545.000000
mean     34.021122  11140.459406   1031.686121      1.103630
std      16.565517   6558.649572   2073.919990      0.536967
min       2.000000     30.000000      3.000000     -1.000000
25%      22.000000   4977.000000    249.000000      1.000000
50%      31.000000  11247.000000    479.000000      1.000000
75%      50.000000  16671.000000   1192.000000      1.000000
max      59.000000  22162.000000  27990.000000     10.000000

In [6]:
df_raw_sales.loc[df_raw_sales['item_cnt_day']== -1]

           date  shop_id  item_id  item_price  item_cnt_day
179  2015-01-04       35     7877     3990.00          -1.0
305  2015-01-04       25     2575     2099.00          -1.0
386  2015-01-04       21     2946      449.00          -1.0
391  2015-01-04       21     1523      799.00          -1.0
825  2015-01-04       52    16677      332.67          -1.0
899  2015-01-04       44    14652      199.00          -1.0
901  2015-01-04       44     8095      499.00          -1.0
926  2015-01-04       44     1114      299.00          -1.0
1161 2015-01-04       42     1878     2599.00          -1.0
1416 2015-01-04       19     2690     1598.00          -1.0
1694 2015-01-04       35     7877     3990.00          -1.0
1820 2015-01-04       25     2575     2099.00          -1.0
1901 2015-01-04       21     2946      449.00          -1.0
1906 2015-01-04       21     1523      799.00          -1.0
2340 2015-01-04       52    16677      332.67          -1.0
2414 2015-01-04       44    14652      199.00          -1.0
2416 2015-01-04       44     8095      499.00          -1.0
2441 2015-01-04       44     1114      299.00          -1.0
2676 2015-01-04       42     1878     2599.00          -1.0
2931 2015-01-04       19     2690     1598.00          -1.0
3209 2015-01-04       35     7877     3990.00          -1.0
3335 2015-01-04       25     2575     2099.00          -1.0
3416 2015-01-04       21     2946      449.00          -1.0
3421 2015-01-04       21     1523      799.00          -1.0
3855 2015-01-04       52    16677      332.67          -1.0
3929 2015-01-04       44    14652      199.00          -1.0
3931 2015-01-04       44     8095      499.00          -1.0
3956 2015-01-04       44     1114      299.00          -1.0
4191 2015-01-04       42     1878     2599.00          -1.0
4446 2015-01-04       19     2690     1598.00          -1.0

In [7]:
#we do a count to see the number of devolutions that have been made during the day.
#the result is 30. by conserving then we preser the stock available and the true income of the enterprise.df_raw_sales. if we preferred to change them by a 0 or a NaN we could use a .replace() to do it.
df_raw_sales.loc[df_raw_sales['item_cnt_day']== -1].count()

date            30
shop_id         30
item_id         30
item_price      30
item_cnt_day    30
dtype: int64

In [31]:
#we look for null values
df_raw_sales[df_raw_sales.shop_id.isnull()]

Empty DataFrame
Columns: [date, shop_id, item_id, item_price, item_cnt_day]
Index: []

In [11]:
#add a column with benefit representing the number of items solds by the price of them
df_raw_sales['item_benefit'] = df_raw_sales['item_price']*df_raw_sales['item_cnt_day']
df_raw_sales

           date  shop_id  item_id  item_price  item_cnt_day  item_benefit
0    2015-01-04       29     1469      1199.0           1.0        1199.0
1    2015-01-04       28    21364       479.0           1.0         479.0
2    2015-01-04       28    21365       999.0           2.0        1998.0
3    2015-01-04       28    22104       249.0           2.0         498.0
4    2015-01-04       28    22091       179.0           1.0         179.0
...         ...      ...      ...         ...           ...           ...
4540 2015-01-04       15     4240      1299.0           1.0        1299.0
4541 2015-01-04       14    21922        99.0           1.0          99.0
4542 2015-01-04       15     1969      3999.0           1.0        3999.0
4543 2015-01-04       14    22091       179.0           1.0         179.0
4544 2015-01-04       15     1007      1199.0           1.0        1199.0

[4545 rows x 6 columns]

In [17]:
)
df_sales_by_shop = df_raw_sales.groupby(['shop_id']).sum()
sales_by_shop = df_sales_by_shop.drop(columns = ['item_id','item_price'])
sales_by_shop.sort_values( by = 'item_benefit', ascending = False).head(5)

         item_cnt_day  item_benefit
shop_id
42              249.0      330111.0
31              402.0      304692.0
12              216.0      295173.0
25              312.0      288432.0
21              180.0      228999.0

In [20]:
sales_by_shop.sort_values( by = 'item_benefit', ascending = False).describe()

       item_cnt_day   item_benefit
count     45.000000      45.000000
mean     111.466667  112928.346667
std       87.046905   84000.575563
min       18.000000   10665.000000
25%       60.000000   51420.000000
50%       78.000000   85737.000000
75%      150.000000  142863.000000
max      402.000000  330111.000000

In [31]:
df_sales_by_item = df_raw_sales.groupby(['item_id']).sum()
df_sales_by_item.drop(columns = ['shop_id'])

         item_price  item_cnt_day  item_benefit
item_id
30            507.0           3.0         507.0
31           1089.0           3.0        1089.0
32            447.0           3.0         447.0
42            897.0           3.0         897.0
59            747.0           3.0         747.0
...             ...           ...           ...
22091        1074.0           6.0        1074.0
22092         537.0           3.0         537.0
22104         747.0           6.0        1494.0
22140         652.5           3.0         652.5
22162        5985.0          18.0        7182.0

[985 rows x 3 columns]

In [35]:
df_sales_item = pd.read_sql('SELECT * FROM sales_by_item', conn)
df_sales_item.drop(columns = [''])

      item_id  item_earnings  total_items_sold        date
0          30          169.0               1.0  03/09/2019
1          31          363.0               1.0  03/09/2019
2          32          149.0               1.0  03/09/2019
3          42          299.0               1.0  03/09/2019
4          59          249.0               1.0  03/09/2019
...       ...            ...               ...         ...
2950    22091          358.0               2.0  03/12/2019
2951    22092          179.0               1.0  03/12/2019
2952    22104          249.0               2.0  03/12/2019
2953    22140          217.5               1.0  03/12/2019
2954    22162         1995.0               6.0  03/12/2019

[2955 rows x 4 columns]

In [14]:
df_sales_item_index = pd.read_sql('SELECT * FROM sales_by_item_index', conn)
df_sales_item_index.head(5)

   id  item_id  item_earnings  total_items_sold        date
0   1       30          169.0               1.0  03/12/2019
1   2       31          363.0               1.0  03/12/2019
2   3       32          149.0               1.0  03/12/2019
3   4       42          299.0               1.0  03/12/2019
4   5       59          249.0               1.0  03/12/2019

In [38]:
df_sales_shop = pd.read_sql('SELECT * FROM sales_by_shop', conn)
df_sales_shop

    shop_id  shop_earnings  total_items_sold        date
0         2        33023.5              27.0  03/09/2019
1         3        22481.0              11.0  03/09/2019
2         4         9787.0              13.0  03/09/2019
3         5        11046.0              15.0  03/09/2019
4         6        38784.0              50.0  03/09/2019
..      ...            ...               ...         ...
85       55        24204.2              60.0  03/12/2019
86       56        15703.0              25.0  03/12/2019
87       57        73078.0             108.0  03/12/2019
88       58        45106.0              56.0  03/12/2019
89       59        37451.0              37.0  03/12/2019

[90 rows x 4 columns]